<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
  <channel>
    <title>Life on Harecoded</title>
    <link>https://www.harecoded.com/tags/life/</link>
    <description>Recent content in Life on Harecoded</description>
    <generator>Hugo -- gohugo.io</generator>
    <language>en-us</language>
    <lastBuildDate>Fri, 09 Jan 2009 18:00:16 +0000</lastBuildDate>
    
	<atom:link href="https://www.harecoded.com/tags/life/index.xml" rel="self" type="application/rss+xml" />
    
    
    <item>
      <title>Borra 10 amigos de Facebook y llévate una Whopper gratis</title>
      <link>https://www.harecoded.com/borra-10-amigos-facebook-llevate-whopper-gratis-184528/</link>
      <pubDate>Fri, 09 Jan 2009 18:00:16 +0000</pubDate>
      
      <guid>https://www.harecoded.com/borra-10-amigos-facebook-llevate-whopper-gratis-184528/</guid>
      <description>S&amp;iacute;, s&amp;iacute;, como los has le&amp;iacute;do. Sacrifica 10 de tus amigos en Facebook por una hamburguesa. As&amp;iacute; de absurdo.
Hoy me encuentro en un art&amp;iacute;culo de CNET que los se&amp;ntilde;ores de Burger King han lanzado una campa&amp;ntilde;a de m&amp;aacute;rketing viral que consiste en instalarse una aplicaci&amp;oacute;n de Facebook y borrar 10 de tus amigos. La han bautizado Whopper Sacrifice, y seg&amp;uacute;n parece, al acabar el sacrificio te dan un cup&amp;oacute;n v&amp;aacute;lido para una Whopper gratis (un cup&amp;oacute;n por cuenta Facebook).</description>
    </item>
    
    <item>
      <title>¡Hola Nexoblogs! Ya estamos aquí.</title>
      <link>https://www.harecoded.com/hola-nexoblogs-aqui-112363/</link>
      <pubDate>Wed, 23 Jul 2008 23:16:40 +0000</pubDate>
      
      <guid>https://www.harecoded.com/hola-nexoblogs-aqui-112363/</guid>
      <description>Harecoded lleva varios a&amp;ntilde;os online contando historias relacionadas principalmente con la tecnolog&amp;iacute;a, combinando art&amp;iacute;culos en espa&amp;ntilde;ol (los menos) &amp;nbsp;y en ingl&amp;eacute;s. Hoy hemos dado un paso adelante y migramos nuestro antiguo sistema wordpress al gestor de contenidos OboLog, formando parte de la red de blogs Nexoblogs.
De esta forma, pasamos a formar parte de una gran comunidad y aprovechamos las fant&amp;aacute;sticas funcionalidades que ofrece OboLog. Con este cambio, aprovechamos para publicar el nuevo dise&amp;ntilde;o y nos marcamos como objetivo publicar m&amp;aacute;s art&amp;iacute;culos en espa&amp;ntilde;ol ya que nexoblogs es una red de habla hispana.</description>
    </item>
    
    <item>
      <title>Good news for Christmas</title>
      <link>https://www.harecoded.com/good-news-for-christmas-96363/</link>
      <pubDate>Fri, 14 Dec 2007 00:00:00 +0000</pubDate>
      
      <guid>https://www.harecoded.com/good-news-for-christmas-96363/</guid>
      <description>Well, this has not been a good year overall for me, but it seems it might end a little better than it started...
FIATC, my burned car&#39;s insurance company is doing a straight good job, so I will get a fair compensation for my car&#39;s lost, hopefully over the next week. Hurrah! Now that it seems 70% of the cash invested in my poor 2 years old Honda Civic is going to be restored, I am looking for some candidates to choose the car that will drive my ways everyday.</description>
    </item>
    
    <item>
      <title>Burned out</title>
      <link>https://www.harecoded.com/burned-out-96362/</link>
      <pubDate>Sun, 09 Dec 2007 00:00:00 +0000</pubDate>
      
      <guid>https://www.harecoded.com/burned-out-96362/</guid>
      <description>Sadly, the subject of this post is not related in any way to the console game. Following is the actual state of my beloved car (as of beautiful, useful and non problematic), a 2005 Honda Civic which always worked like a charm.
 The Civic was correctly parked in front of my house when yesterday at 3am the car next to him started burning and the flames took by assault my car as well: this is known as the &#34;</description>
    </item>
    
    <item>
      <title>Going to the cinema is fustrating...</title>
      <link>https://www.harecoded.com/going-to-the-cinema-is-fustrating-96308/</link>
      <pubDate>Tue, 03 Jan 2006 00:00:00 +0000</pubDate>
      
      <guid>https://www.harecoded.com/going-to-the-cinema-is-fustrating-96308/</guid>
      <description>Audience in cinemas has fallen in the last year... myself included. The prices are too high, there is a lot of advertising before the film (as if it were public TV) and usually lacks of cleaness and silence.... A funny article to read by James R. Stoup</description>
    </item>
    
    <item>
      <title>Happy new year 2006!!!</title>
      <link>https://www.harecoded.com/happy-new-year-2006-96307/</link>
      <pubDate>Sat, 31 Dec 2005 00:00:00 +0000</pubDate>
      
      <guid>https://www.harecoded.com/happy-new-year-2006-96307/</guid>
      <description>All the harecoded team want you to have a happy new year 2006 full of peace, health, love, money and... more geekery :)</description>
    </item>
    
  </channel>
</rss>