<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>Introspección gadgetera &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  <style>
aside.sidebar h1 {
	font-size: 2.8rem;
}
</style>
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="http://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="http://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>Introspección gadgetera</h1>
  <time datetime=2007-06-20T00:00:00Z class="post-date">Wed, Jun 20, 2007</time>
  <p>A ra&iacute;z de unos art&iacute;culos (<a href="http://www.serantes.es/?p=746">1</a> y <a href="http://www.serantes.es/?p=748">2</a>) muy interesantes del compa&ntilde;ero <a href="http://www.serantes.es">Serantes</a>, 'gadgetero' e inductor de compras donde los haya, me he puesto tambi&eacute;n a pensar en mi relaci&oacute;n con los aparatos electr&oacute;nicos que pueblan mis estanter&iacute;as y mochila...</p>
<p>Viene a ser una excusa cualquiera para autoanalizarme, para realizar una introspecci&oacute;n aunque sea s&oacute;lo en esta peque&ntilde;a parcela de mi vida.   Como David, realizar&eacute; un breve an&aacute;lisis donde colocar&eacute; en dos zonas bien diferenciadas los dispositivos electr&oacute;nicos que uso en la actualidad:</p>
<p><strong>Zona de utilidad</strong> Se corresponde con la 'zona tranquila' de David Serantes, y est&aacute; ocupada por gadgets que justifican <em>d&iacute;a a d&iacute;a</em> su existencia en mi arsenal ya que me son tremendamente &uacute;tiles: <a href="http://support.apple.com/specs/powerbook/PowerBook_G4_12-inch_DVI.html">powerbook 12"</a>, <a href="http://www.apple.com/es/ipod/ipod.html">ipod v&iacute;deo 30Gb</a>, <a href="http://euro.palm.com/es/es/products/treo650/index.html">treo 650</a>, <a href="http://europe.nokia.com/770">Nokia 770</a> y <a href="http://www.the-gadgeteer.com/review/psion_series_5mx_review">psion 5mx</a>.</p>
<p>A veces tengo crisis con el treo 650 e intento desbancarlo a la zona peligrosa (ver m&aacute;s abajo) por ladrillo y pesado, pero me frena el echo de que me hace un servicio genial cada d&iacute;a, y que s&eacute; por experiencia que no encontrar&eacute; nada igual para manejar notas y sus relaciones con calendario, contactos. Es el gadget que m&aacute;s uso.</p>
<p>Por tanto, en esta zona aparecen aquellos equipos muy &uacute;tiles y que s&eacute; positivamente que no los podr&iacute;a cambiar por mejores, o al menos la relaci&oacute;n mejora/dinero a pagar extra no es suficiente para pensar en un cambio en la actualidad.&nbsp;</p>
<p><strong>Zona de experimentaci&oacute;n:</strong> Esta zona es precaria por definici&oacute;n, en ella est&aacute;n los dispositivos que he adquirido recientemente y que est&aacute;n pasando el examen para promocionar a la zona de utilidad. La superaci&oacute;n del examen pasa exclusivamente por considerarlos &uacute;tiles en el d&iacute;a a d&iacute;a... o que al menos cubran un nicho de uso &uacute;nico e irremplazable por otros gadgets: caso del psion 5mx.</p>
<p>En ella entran tambi&eacute;n todas mis adquisiciones de accesorios para completar sus funcionalidades/corregir algunas deficiencias... Esta es con diferencia la parte donde pierdo m&aacute;s dinero con la compra/venta, pero a veces tienes que ofrecer alicientes extra si quieres vender r&aacute;pido.</p>
<p>&Uacute;ltimamente he hecho bastante 'limpieza', as&iacute; que la zona de experimentaci&oacute;n se encuentra ahora mismo... <strong>&iexcl;vac&iacute;a</strong>! Pero s&eacute; que no durar&aacute; mucho as&iacute;, porque siempre tengo inquietud por alojar a nuevos inquilinos, por recibir visitas extra&ntilde;as o muy esperadas...   Necesito (s&iacute;, necesito) la novedad, jugar con nuevos gadgets, pasar por el proceso de descubrir/leer comparativas/construirme necesidades/sondear el mercado de segunda mano/comprar/zona de experimentaci&oacute;n... Y cuando digo novedad no me refiero a tener lo &uacute;ltimo de lo &uacute;ltimo, me refiero a adquirir cualquier cacharro que no haya tenido antes, caso de la psion 5mx de nuevo, un trasto de 9 a&ntilde;os nada menos... cuanto m&aacute;s raro el gadget y un nicho de mercado m&aacute;s peque&ntilde;o, tanto mejor. La convergencia de funciones en un solo dispositivo no est&aacute; hecha para m&iacute; :-)</p>
<p>Estoy contento de que en la actualidad la zona de utilidad tenga mucho m&aacute;s protagonismo que la de experimentaci&oacute;n, y espero y deseo que esto siga as&iacute; porque lo contrario es estar en un permanente estado febril de b&uacute;squeda/compra/desilusi&oacute;n/venta, que me quita tiempo (horas de sue&ntilde;o literalmente) y energ&iacute;as, muchas energ&iacute;as.</p>
<p>De todas formas, no me enga&ntilde;o, hay &eacute;pocas en que parece estar todo muy tranquilo y de repente estalla la revoluci&oacute;n... sin ir m&aacute;s lejos, este mes de Mayo pasado. Las piezas est&aacute;n encajadas con tal delicadeza (l&eacute;ase precariedad) en la zona de utilidad que el solo movimiento de una de ellas provoca la ca&iacute;da de toda la estructura, para resurgir a las pocas semanas un poco m&aacute;s s&oacute;lida (espero) que antes.  Un ejemplo claro de esto ha sido mi &uacute;ltima crisis:</p>
<p>
<ul>
<li>No estoy usando la <a href="http://www.nseries.com/products/n800/">Nokia N800</a> que compr&eacute; nueva de trinca (cosa rara en m&iacute;) hace 1 mes, zona de experimentaci&oacute;n no superada. - Venta de Nokia N800 con accesorios (funda, 2 targetas Sd de 2Gb).&nbsp;</li>
<li>Venta de <a href="http://en.wikipedia.org/wiki/Psion_5">Psion 5</a> que compr&eacute; dos semanas antes que la 5mx... este ordenadorcito me encanta, pero no puedo evitar ir a por el modelo superior. Juego con la idea de guard&aacute;rmela de repuesto, pero soy estricto con el tonelaje m&aacute;ximo de gadgets a conservar.&nbsp;</li>
<li>Me <a href="http://www.harecoded.com/2007/06/04/obsolescencia/">voy de conferencias</a> a <a href="http://es.wikipedia.org/wiki/Stuttgart">Stuttgart</a>, no me llevo el Powerbook 15" Titanium por su tama&ntilde;o, en cambio me llevo el iBook G3 de mi mujer y la psion. Me lo apunto mentalmente, s&iacute;ntomas de crisis por venir.&nbsp;</li>
<li>La venta del N800 provoca compra inmediata de Nokia 770 e iPod V&iacute;deo 30Gb. De resultado me queda un remanente de 50 euros para reinvertir, siempre reinvertir :-)&nbsp;</li>
<li>Compra de iPod V&iacute;deo provoca venta de iPod 20Gb 2g... ha sido muy fiel durante a&ntilde;os y lo echar&eacute; de menos, pero ahora uso menos el coche/camino m&aacute;s, y no lo estoy usando por su volumen y peso.&nbsp;</li>
<li>Venta de iPod 20Gb 2g me da para pensar que vendiendo el Powerbook G4 15" Titanium, un iCurve que no uso y poniendo un poco m&aacute;s, tengo para otro port&aacute;til... Total, el powerbook lo uso muy poco porque me ralla el ruido constante de su ventilador y tiene la bater&iacute;a casi muerta, adem&aacute;s de su tama&ntilde;o. Adi&oacute;s a una gloriosa pantalla, pero no hay dolor.&nbsp;</li>
<li>Pensar s&oacute;lo de vender el powerbook provoca su inmediata defenestraci&oacute;n... puesta en venta de iCurve, teclado apple pro para cubrir costes.&nbsp;</li>
<li>Compra de Powerbook 12", me encanta su tama&ntilde;o y su funda Tucano. &iexcl;Gracias David!&nbsp;</li>
<li>Venta de Powerbook G4 Titanium e iCurve.</li>
</ul>
</p>
<p>Total, en cuesti&oacute;n de un mes he movido 9 items, y ahora vuelvo a tener una zona de utilidad fuerte y estable... &iexcl;espero!  De todas formas, en la zona de experimentaci&oacute;n se cuece algo como siempre... hace ya tiempo que juego con la idea de encontrar la excusa para agenciar la Treo 650 y pillarme un m&oacute;vil Nokia liviano y que se pueda usar de gps...</p>
<p>Tambi&eacute;n he querido tener siempre una Palm Z22 para volver a los or&iacute;genes del zen de Palm (menos es m&aacute;s), como he le&iacute;do de alg&uacute;n que otro snob por ah&iacute; (yo m&aacute;s snob, claro). As&iacute; que cuando la encuentre tirada de precio podr&iacute;a ser el detonante de una nueva mini crisis. Por otra parte, me qued&eacute; con ganas de adquirir una <a href="http://www.gelhaus.net/cgi-bin/page.py?loc:zaurus/+content:review_C1000.html">Zaurus C-1000</a> en vez de la Nokia 770, por lo que tengo otro posible foco de inestabilidad...</p>
<p>Am&eacute;n de que cuando llegue el <a href="http://www.apple.com/iphone/">iPhone</a> a Espa&ntilde;a provocar&aacute; movimientos s&iacute;smicos que har&aacute;n temblar los cimientos mismos de mi estructura gadgetera, construida con mucho esfuerzo a base de mimbre, arcilla y ca&ntilde;as de bamb&uacute;...  &iexcl;Que todas mis preocupaciones sean estas!</p>
</div>


    </main>

    
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;
	ga('create', 'UA-130600512-1', 'auto');
	
	ga('send', 'pageview');
}
</script>
<script async src='https://www.google-analytics.com/analytics.js'></script>

  </body>
</html>
