<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>Configuració de Mac OS X per veure el programari en català &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="https://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="https://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>Configuració de Mac OS X per veure el programari en català</h1>
  <time datetime=2005-10-10T00:00:00Z class="post-date">Mon, Oct 10, 2005</time>
  <p>A la versi&oacute; Tiger del sistema Mac OS X no es va incorporar finalment el sistema operatiu en catal&agrave;. Tot i aix&oacute;, hi ha programari de tercers que est&agrave; localitzat al catal&agrave;. Per veure'l en el vostre idioma per&oacute;, cal que feu una sola vegada les instruccions que a continuaci&oacute; us proporcionem. Si ja us sentiu molt c&oacute;modes amb el mac, i per no fer-vos esperar m&eacute;s, cal que entreu a les prefer&egrave;ncies del sistema / internacional i escolliu el catal&agrave; com el primer idioma de la llista. Si per contra voleu veure com es fa pas a pas, seguiu llegint, i mirant... :)</p>
<h2>Pas 1: Obriu les prefer&egrave;ncies del sistema</h2>
<p>A la barra superior del Finder, cliqueu sobre la icona de la poma i despr&eacute;s sobre <code>Preferencias del sistema</code></p>
<div style="text-align: center; clear: both"><img title="96293-83266.jpg" src="/img/posts/96293-83266.jpg" alt="96293-83266.jpg" width="262" height="135" /></div>
<h2>Pas 2: Obriu <em>Internacional</em></h2>
<p>Cerqueu la icona d'<code>internacional</code> en la nova finestra i feu-hi un clic.</p>
<div style="text-align: center; clear: both"><img title="96293-83272.jpg" src="/img/posts/96293-83272.jpg" alt="96293-83272.jpg" width="355" height="131" /></div>
<h2>Pas 3: Comproveu que el catal&agrave; no sigui a la llista</h2>
<p>A continuaci&oacute; s'us obrir&agrave; una llista d'idiomes disponibles. Comproveu que el catal&agrave; no sigui a la llista, si apareix&eacute;s el primer no cal que continueu llegint, si n&oacute; feu clic al bot&oacute; que diu <code>Editar lista</code></p>
<div style="text-align: center; clear: both"><img title="96293-83269.jpg" src="/img/posts/96293-83269.jpg" alt="96293-83269.jpg" /></div>
<h2>Pas 4: Incorporeu el catal&agrave;</h2>
<p>Baixeu fins que trobeu <code>Catal&agrave;</code> i marqueu-lo per a que es mostri. Feu clic en <code>OK</code></p>
<div style="text-align: center; clear: both"><img title="96293-83271.jpg" src="/img/posts/96293-83271.jpg" alt="96293-83271.jpg" width="231" height="232" /></div>
<h2>Pas 5: Poseu-lo com a idioma per defecte</h2>
<p>El catal&agrave; us sortir&agrave; el darrer de la llista. Heu d'arrosegar-lo fins a dalt de tot perqu&egrave; quedi el primer de la llista. Si no estigu&eacute;s el primer, cada cop que arrenquessiu un programa, el OS X comprovaria si est&agrave; disponible en l'idioma que hi ha per damunt del catal&agrave; i el mostraria en aquell idioma i segurament mai arribarieu a veure un programa en catal&agrave;.</p>
<div style="text-align: center; clear: both"><img title="96293-83270.jpg" src="/img/posts/96293-83270.jpg" alt="96293-83270.jpg" width="267" height="56" /></div>
<h2>Pas 6: Necessiteu tancar la sessi&oacute; per aplicar els canvis</h2>
<p>El sistema us informar&agrave; que necessiteu tancar la sessi&oacute; per veure els programes en catal&agrave;.Per fer-ho torneu a la barra superior, cliqueu la poma i sel&Acirc;&middot;leccioneu <code>Cerrar Sesi&oacute;n</code></p>
<div style="text-align: center; clear: both"><img title="96293-83268.jpg" src="/img/posts/96293-83268.jpg" alt="96293-83268.jpg" width="169" height="174" /></div>
<h2>Fi: Gaudiu del programari en catal&agrave;</h2>
<p>Ara ja podeu obrir els programes que tenen suport pel catal&agrave;, com l'Adium o el Cyberduck (a la foto), etc...</p>
<div style="text-align: center; clear: both"><img title="96293-83267.jpg" src="/img/posts/96293-83267.jpg" alt="96293-83267.jpg" width="269" height="213" /></div>
<h2>Notes complementaries...</h2>
<ul>
<li>Aquest canvi NO &eacute;s perill&oacute;s pel vostre sistema i nom&eacute;s afecta al usuari actual.</li>
<li>Desafortunadament, tot el programari no est&agrave; disponible en catal&agrave;. Aix&iacute; que nom&eacute;s veureu els programes en catal&agrave; si estan disponibles.</li>
<li>Seguint aquestes passes feu que si un programa est&agrave; disponible en catal&agrave; el mostrar&agrave; abans que en castell&agrave; o en angl&egrave;s.</li>
<li>Hi ha programes que contenen en el paquet un sol idioma, com el Firefox, i haureu de descarregar la versi&oacute; exclusiva catalana des d'internet. El mateix passa amb el Thunderbird o l'Nvu.</li>
</ul>
<p>A continuaci&oacute; s'us obrir&agrave; una llista d'idiomes disponibles. Comproveu que el catal&agrave; no sigui a la llista, si apareix&eacute;s el primer no cal que continueu llegint, si n&oacute; feu clic al bot&oacute; que diu Editar lista  La versi&oacute; m&eacute;s actualitzada d'aquest document la deixem penjada a <a href="http://www.softcatala.org/wiki/Mac_en_catal&agrave;:_Guia_visual">Softcatal&agrave;</a></p>
</div>


    </main>

    
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;
	ga('create', 'UA-130600512-1', 'auto');
	
	ga('send', 'pageview');
}
</script>
<script async src='https://www.google-analytics.com/analytics.js'></script>

  </body>
</html>
