+++
date = "2008-02-25 00:00:00"
author = "maguilar"
title = "Exitazo de la primera PHP Barcelona Conference"
slug = "exitazo-primera-php-barcelona-conference-96367"
tags = [ "conferencias","php" ]
+++
<p style="text-align: center;">
<object classid="clsid:d27cdb6e-ae6d-11cf-96b8-444553540000" width="425" height="355" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0">
<param name="wmode" value="transparent" />
<param name="src" value="http://www.youtube.com/v/IGoR0iXuvbw&amp;rel=1" /><embed height="355" width="425" src="http://www.youtube.com/v/IGoR0iXuvbw&amp;rel=1" wmode="transparent" type="application/x-shockwave-flash"></embed>
</object>
</p>
<p>Pues s&iacute;, el s&aacute;bado 23 de Febrero celebramos la primera <a href="http://www.phpbarcelona.org">PHP Barcelona Conference</a>, y fue todo un exitazo: de participaci&oacute;n, de organizaci&oacute;n (no se nos descuajaring&oacute; la agenda), las instalaciones (<a href="http://www.bocanord.org/">Bocanord</a>) eran fant&aacute;sticas as&iacute; como los medios que pusieron a nuestra disposici&oacute;n; la mejor sala del complejo, un equipo de proyecci&oacute;n de cine y buena voluntad a raudales.</p>
<p>Por mi parte, qued&eacute; muy contento con mi presentaci&oacute;n "<a href="http://www.slideshare.net/maguilar/phpbarcelona-conference-optimizacin-aplicaciones-php-client-side/">Optimizaci&oacute;n de aplicaciones PHP - Client Side</a>", puesto que la pude desarrollar con muy buen ritmo en todo momento y me dio tiempo a explicarlo todo. La verdad es que me com&iacute; 6 minutos del piscolabis, pero con s&oacute;lo 30 minutos era una locura intentar explicar los entresijos de la optimizaci&oacute;n de cach&eacute; del navegador, peticiones http, compresi&oacute;n de ficheros javascript, etc.</p>
<p>La audiencia se port&oacute; de lujo y la verdad es que la presentaci&oacute;n sali&oacute; rodada. &iexcl;Prueba superada! :-) Del resto de presentaciones, la que m&aacute;s me impresion&oacute; fue la de <a href="http://www.xing.com/profile/Arno_Schneider3">Arno Schneider</a> (Continuous Integration, Xing), por el grado de preparaci&oacute;n y la profesionalidad con que Arno fue desgranando el temario tan complejo que present&oacute;. Un 10 para ti Arno, con esa calidad de presentaci&oacute;n puedes ir a cualquier conferencia internacional con la cabeza bien alta.  Tambi&eacute;n qued&eacute; impresionado con el nivel de trabajo y organizaci&oacute;n desarrollados por <a href="http://www.phpbsd.net">Oriol Jim&eacute;nez</a> y <a href="http://david-gaya-casabon.neurona.com/">David Gaya</a>, los aut&eacute;nticos cerebros detr&aacute;s del evento. Ahora se merecen un aut&eacute;ntico descanso, pobres... :-)</p>
<p>En fin, todos coincidimos en que nos hemos quedado con MUCHAS ganas de celebrar m&aacute;s y mayores conferencias, as&iacute; que &iexcl;<strong>estad atentos phperos</strong>!</p>