+++
date = "2009-01-09 00:00:00"
author = "alombarte"
title = "El fin de las fotos movidas en el iPhone, con Darkroom"
slug = "fotos-movidas-iphone-darkroom-183552"
tags = [ "apple","apps","gadgets","iphone","software" ]
+++
<p><img style="border: 1px solid #cccccc; margin: 10px; float: right;" title="Logo steady" src="/img/posts/183552-113371.jpg" alt="Logo steady" />Se acab&oacute; que las fotos del iphone salgan movidas!</p>
<p>Si tienes un pulso tan bueno como el m&iacute;o te habr&aacute;s encontrado m&aacute;s de una vez que haces varias tomas de fotograf&iacute;as y siempre te sale la foto desenfocada o movida. Pero tu tienes paciencia y tiras la misma foto 40 veces hasta que sale bien. El simple hecho de pulsar el bot&oacute;n de fotografiar hace que esa m&iacute;nima presi&oacute;n nos mueva el objetivo y adi&oacute;s foto.</p>
<p>Pues los se&ntilde;ores de Stepcase Limited han creado una aplicaci&oacute;n gratuita llamada <strong><a title="Enlace iTunes a Darkroom" href="http://itunes.apple.com/WebObjects/MZStore.woa/wa/viewSoftware?id=298256007&amp;mt=8">Darkroom</a> </strong>(esta semana pasada se llamaba <strong><a title="Enlace iTunes a Darkroom" href="http://itunes.apple.com/WebObjects/MZStore.woa/wa/viewSoftware?id=298256007&amp;mt=8">SteadyCam</a></strong>) que se espera a tirar la foto hasta que tu pulso est&aacute; estabilizado. Pulsas el bot&oacute;n de tirar foto y la aplicaci&oacute;n a trav&eacute;s de un sensor de movimiento cuando detecta un momento de paz en tu mano saca la foto.</p>
<p>Una vez ha sacado la foto pregunta que quieres hacer con ella, si la quieres conservar o desechar y a continuaci&oacute;n deja la c&aacute;mara preparada para otro disparo. En las preferencias puedes marcar que guarde autom&aacute;ticamente cada disparo.</p>
<p>Es un poco lenta la guardar la foto, pero se puede perdonar. Almenos hace que las fotos de iPhone se puedan ver y dejen de ser tan indecentes!</p>
<p>Por la barbaridad de 0,79&euro; existe una versi&oacute;n premium con funcionalidades a&ntilde;adidas, pero a mi con esta me vale :)</p>
<p style="text-align: center;"><a class="thickbox" title="SteadyCam, tomando fotograf&iacute;as" href="/img/posts/183552-113376.jpg" alt="Preferencias SteadyCam" /> </a></p>
<p><a href="http://itunes.apple.com/WebObjects/MZStore.woa/wa/viewSoftware?id=298256007&amp;mt=8">Enlace para <strong>descargar Darkroom (SteadyCam)</strong> en iTunes</a></p>