<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>El todo o nada para Palm: presentación de Nova en el CES de 2009 &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="https://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="https://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>El todo o nada para Palm: presentación de Nova en el CES de 2009</h1>
  <time datetime=2009-01-07T00:00:00Z class="post-date">Wed, Jan 7, 2009</time>
  <p>De todos es conocido que Palm, la inventora del concepto pda que por tanto tiempo domin&oacute; el nuevo mercado que tan bien supo crear, atraviesa por una situaci&oacute;n muy, muy dif&iacute;cil despu&eacute;s de varios a&ntilde;os de ir a la deriva. <br /><br />Tras un sistema operativo excelente pero inestable y vetusto (PalmOS) que no ha sabido renovar en 5 a&ntilde;os, una l&iacute;nea de smartphones Treo legendaria pero que ya no puede con la competencia y fiascos como el Foleo, Palm lleva dos temporadas sobreviviendo a base de sacar el en&eacute;simo smartphone Treo con Windows Mobile, inferior a los dem&aacute;s en dise&ntilde;o, tama&ntilde;o y prestaciones.<br /><br />Aquella compa&ntilde;&iacute;a que maravillaba por la simplicidad, elegancia y eficiencia del software que integraba en sus dispositivos, tiene una &uacute;ltima oportunidad para demostrar que puede competir con monstruos como RIM, Google/HTC (Android), Microsoft, Nokia o Apple. Este jueves 8 de Enero Ed Colligan, CEO de Palm, presentar&aacute; Nova, el nuevo y tan esperado sistema operativo en la feria CES (Computer Entertainment Show) de Las Vegas. Seguramente mostrar&aacute; alg&uacute;n nuevo modelo de m&oacute;vil que lo integre --se especula con que incorporar&aacute; un teclado extra&iacute;ble, como el que se ve en el dise&ntilde;o adjunto--, y es muy posible que tambi&eacute;n muestre aplicaciones de terceros que ya funcionen en la nueva plataforma.</p>
<p style="text-align: center;"><img title="Nuevo concepto de Palm 2009" src="/img/posts/183065-113155.jpg" alt="Nuevo concepto de Palm 2009" width="250" height="416" /></p>
<p><br /><br />Ojal&aacute; que Palm haya sabido analizar de manera realista el mercado y se posicione fuertemente de nuevo en el &uacute;nico nicho que puede ocupar hoy en d&iacute;a: el de proporcionar la excelencia en las aplicaciones PIM (contacto, agenda, notas). Aquel segmento de mercado en el que nunca ha dejado de ser el rey, por m&eacute;ritos propios pero tambi&eacute;n porque el resto de competidores nunca se han propuesto entrar en &eacute;l.<br /><br />RIM es el rey indiscutible de la mensajer&iacute;a con sus Blackberrys, Apple es insuperable en ocio y multimedia, Google Android se posicionar&aacute; seguramente como la mejor plataforma para web, Windows Mobile es la navaja suiza en el mundo m&oacute;vil (lo hace todo, pero no es bueno en nada) y Nokia inunda cada a&ntilde;o el mercado con sus modelos basados en Symbian, otro S.O. generalista que encanta a los que prefieren el form factor de m&oacute;vil tradicional. <br /><br />Palm ya no tiene ninguna posibilidad de competir con cualquiera de estos monstruos en sus segmentos, as&iacute; que si ma&ntilde;ana Ed Colligan nos sale con el en&eacute;simo competidor del iphone, se acab&oacute;, finito, adi&oacute;s a la marca del logo naranja. Ojal&aacute; que no sea as&iacute;, y veamos un sistema operativo valiente, que se centre en las aplicaciones PIM y la excelencia en la introducci&oacute;n de datos en los nuevos modelos de smartphone; ojal&aacute; veamos un buen tel&eacute;fono, con unas aplicaciones multimedia decentes, pero que tenga un manejo potente de agenda, tareas, notas, e-mail, wiki. Ojal&aacute; dejen de hacer dise&ntilde;os y carcasas cutres, con forma de ladrillo, ya muy pasados de moda.Y todo ello con la elegancia que Palm ha mostrado siempre en sus interfaces de usuario.<br /><br />Ciertamente este mercado es minoritario y no va a dar el beneficio de los otros, pero es un mercado que Palm dominaba y todav&iacute;a puede recuperar, donde a poco que haga seguir&aacute; siendo el rey por muchos a&ntilde;os. Hay muchos ex-usuarios que volver&iacute;an al zen de Palm si se vuelven a presentar dispositivos con prestaciones modernas pero que conserven la excelencia en la gesti&oacute;n de informaci&oacute;n que Palm tra&iacute;a inherente a la marca. <br /><br />Muchos echamos de menos aquellas pdas, las tungsten, las zire (a&uacute;n conservo una z22 y me es muy &uacute;til)... Mi mujer todav&iacute;a usa extensamente una Palm Zire 71 que le regal&eacute; hace 4 a&ntilde;os, &iexcl;&iexcl;4 a&ntilde;os!! No ha tenido una agenda tan &uacute;til como esa, y ciertamente, cuando la Zire 71 se muera no se me ocurre ning&uacute;n m&oacute;vil que la pueda suplir para ella en la gesti&oacute;n PIM... Lo m&aacute;s parecido es una Blackberry Curve, pero algo de la magia de la Zire se perder&aacute;.<br /><br />As&iacute; pues, &iquest;con qu&eacute; nos sorprender&aacute; Palm ma&ntilde;ana?</p>
</div>


    </main>

    
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;
	ga('create', 'UA-130600512-1', 'auto');
	
	ga('send', 'pageview');
}
</script>
<script async src='https://www.google-analytics.com/analytics.js'></script>

  </body>
</html>
