<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>Calidad de servicio de Symio. Ranking operadoras movil &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="http://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="http://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="http://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>Calidad de servicio de Symio. Ranking operadoras movil</h1>
  <time datetime=2008-09-01T20:18:00Z class="post-date">Mon, Sep 1, 2008</time>
  <p><img style="float:right" title="Atenci&oacute;n al cliente Symio" src="/img/posts/124015-88384.jpg" alt="Atenci&oacute;n al cliente Symio" /></p>
<p style="text-align: left;">He estado en todas las compa&ntilde;&iacute;as de tel&eacute;fono m&oacute;vil que hay disponibles en este pa&iacute;s (bueno, la del Carrefour y la de Pepe no las prob&eacute;). Con todas he tenido alg&uacute;n problema:</p>
<p>Problemas de facturaci&oacute;n excesiva con Movistar, publicidad no solicitada a&uacute;n estando dado de baja de este "servicio", Vodafone que me cobra a n&uacute;meros que no llamo, accesos a internet que no realizo (en tramos perfectos de 1h a las tantas de la madrugada), falta de cobertura en Orange, publicidad no solicitada otra vez, mensajes de n&uacute;meros de alta tarificaci&oacute;n, llamadas nocturnas para venderme una moto... y un largu&iacute;simo etc...</p>
<p>El com&uacute;n con todas ellas es siempre m&aacute;s de un rifi-rafe con atenci&oacute;n al cliente, que no parecen entender (o lo quieren hacer ver) el problema del CLIENTE, que suele ser por su p&eacute;simo servicio y ganas de saltarse los derechos del consumidor a la torera. Por ejemplo, la LOPD para ellos no existe.</p>
<p><strong>La &uacute;ltima joya viene con Simyo</strong>, compa&ntilde;&iacute;a que uso actualmente (a falta de ver que hago al acabar el post).</p>
<p>Resulta que ya empieza a ser habitual que cuando salgo de trabajar y llamo a mi esposa me encuentro con que se cruzan las l&iacute;neas y me encuentro hablando en mitad de una conversaci&oacute;n ajena. Cuando cuelgas y vuelves a llamar, al otro lado cuando descuelgan no se oye nada.</p>
<p>Est&aacute; claro que las 2 llamadas te las cobran :(</p>
<p>Sumado a esto, <strong>me ha sido imposible hablar con otros symio durante un mes y medio</strong> (desde que lo hice saber en atenci&oacute;n al cliente).</p>
<p>Me parece muy grave sobretodo el tema de aparecer en una llamada remota, pues ves que est&aacute;s &nbsp;teniendo intimidad cero. Para colmo, parece ser imposible hablar con el&nbsp;<strong>servicio&nbsp;de atenci&oacute;n al cliente 121,</strong> que <strong>despu&eacute;s de 1 hora </strong>y haber escuchado todo el repertorio de Mozart, he colgado</p>
<p>En fin, almenos la factura s&iacute; es m&aacute;s baja.</p>
<p><strong>Mi ranking (hoy por hoy) de m&aacute;s a menos cutre:</strong></p>
<ol>
<li>Movistar (la m&aacute;s mala)</li>
<li>Symio</li>
<li>Vodafone</li>
<li>Orange</li>
<li>Yoigo (la menos mala)</li>
</ol>
<p style="text-align: left;">&iquest;Habr&aacute; que volver a los vasos y el hilo?</p>
<p style="text-align: left;"><strong>Actualizaci&oacute;n</strong>: Me he pasado a Yoigo, veremos como va la modalidad contrato (prepago sin problemas).</p>
<p style="text-align: left;"><strong>Actualizaci&oacute;n (19/02/2009)</strong>: Parece que la cosa va bien. Estoy ahora con la portabilidad de mi mujer que le acaba de expirar la permanencia con Vodafone, que sin duda dejo, tal y como les promet&iacute;, por robarme 30 euros.</p>
<p style="text-align: left;"><strong>Actualizaci&oacute;n (15/01/2010):&nbsp;</strong> Llevamos m&aacute;s de un a&ntilde;o mi mujer y un servidor en Yoigo sin ninguna incidencia (toquemos madera), sin embargo algunos amigos que <strong>me llaman desde Simyo </strong>no me pueden llamar porque les sale siempre "<strong>El servicio solicitado no est&aacute; disponible desde este tel&eacute;fono</strong>". Seguramente algo habr&aacute;n dejado de mi n&uacute;mero en sus redes.</p>
</div>


    </main>

    
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;
	ga('create', 'UA-130600512-1', 'auto');
	
	ga('send', 'pageview');
}
</script>
<script async src='https://www.google-analytics.com/analytics.js'></script>

  </body>
</html>
