<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>De conferencias con una Psion 5mx &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="https://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="https://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>De conferencias con una Psion 5mx</h1>
  <time datetime=2007-06-04T00:00:00Z class="post-date">Mon, Jun 4, 2007</time>
  <p>Hace unos d&iacute;as tuve la oportunidad de asistir a la <em><a href="http://www.phpconference.com">PHP Conference 2007 spring edition</a></em> celebrada en <a href="http://es.wikipedia.org/wiki/Stuttgart">Stuttgart</a>, Alemania. Dada la experiencia de conferencias anteriores, sab&iacute;a al 100% que no quer&iacute;a llevar un port&aacute;til a las sesiones... Lo he hecho otras veces y odio tener que arrastrar los kilos de tecnolog&iacute;a a todas partes para usarlos s&oacute;lo en contadas ocasiones. Pero sobre todo, odio la dependenia que provoca de los enchufes... te pasas media conferencia buscando con agon&iacute;a los escasos enchufes que la organizaci&oacute;n del evento pone a disposici&oacute;n de los participantes.</p>
<p>Es una cosa que nunca he entendido, c&oacute;mo sabiendo que el 95% de los 300 asistentes va a ir 'armados' de port&aacute;tiles, los organizadores no ponen m&aacute;s que 20 enchufes birriosos repartidos por las salas y el &aacute;rea lounge. Y luego est&aacute;n los puntos de acceso wifi, que indefectiblemente mueren de &eacute;xito el primer d&iacute;a y contin&uacute;an fallando intermitentemente despu&eacute;s por el estr&eacute;s que provocan 300 m&aacute;quinas entrando y saliendo cont&iacute;nuamente.</p>
<p>En fin, como en esta ocasi&oacute;n ten&iacute;a muy claro que el port&aacute;til se quedaba en el hotel (ya me lament&eacute; bastantes veces de haber vendido la nokia N800 el d&iacute;a anterior, me hubiera ahorrado de llevarme de viaje 2 kilos de ibook), me pertrech&eacute; de la mejor herramienta disponible para mi principal necesidad en las conferencias: tomar notas.</p>
<p>S&iacute;, ten&iacute;a claro que durante las sesiones s&oacute;lo me iba a dedicar a escuchar a los ponentes y tomar todas las notas necesarias. Esto es algo que a simple vista parece l&oacute;gico, pero un poco m&aacute;s adelante explicar&eacute; que no lo es, nada m&aacute;s lejos de la realidad.</p>
<p style="text-align: center;"><img title="96331-83262.jpg" src="/img/posts/96331-83262.jpg" alt="96331-83262.jpg" /></p>
<p>Yo no quer&iacute;a tomar notas de manera anal&oacute;gica para pasar luego por el trance de transcribirlas, as&iacute; que necesitaba de un gadget que me permitiera tomarlas de manera &aacute;gil.  Este gadget, pens&eacute;, ten&iacute;a que ser liviano y lo m&aacute;s confiable posible, tanto a nivel de estabilidad como de duraci&oacute;n de la bater&iacute;a. Obligado tambi&eacute;n que tuviera teclado, a ser posible visible sin necesidad de usar lupa. Adem&aacute;s, era para m&iacute; un plus que el gadget fuera de funcionamiento sencillo, y si no ten&iacute;a posibilidades de conectarse a Internet, la mayor fuente de distracciones del mundo para un tecn&oacute;logo, tanto mejor.  As&iacute; que me llev&eacute; la mejor herramienta que conozco que cubre todas estas necesidades: una <a href="http://en.wikipedia.org/wiki/Psion_5">Psion 5mx</a>. Y... &iexcl;Dios, c&oacute;mo se port&oacute;! Durante dos d&iacute;as de uso cont&iacute;nuo consumi&oacute; la friolera de un 10% de sus bater&iacute;as. Escrib&iacute; con ella much&iacute;simas notas y a un gran ritmo, y la psion no me fren&oacute; en ning&uacute;n momento. Me supon&iacute;a un segundo desplegarla y otro recogerla, y tiene un teclado glorioso.</p>
<p style="text-align: center;"><img title="96331-83263.jpg" src="/img/posts/96331-83263.jpg" alt="96331-83263.jpg" /></p>
<p>Pero lo m&aacute;s importante, la psion 5mx me permiti&oacute; concentrarme al 100% en mi necesidad del momento: <strong>escribir</strong>. Vi sin m&aacute;s extra&ntilde;eza (la experiencia de anteriores conferencias es un grado) c&oacute;mo la mayor&iacute;a del resto de asistentes desplegaban sus port&aacute;tiles en cada sesi&oacute;n... algunos agachaban la cabeza buscando enchufes, otros montaban la parada y comenzaban a lanzar aplicaciones como posesos. Todos ellos, mientras comenzaba a hablar el ponente, repet&iacute;an en perfecta sincronizaci&oacute;n el ritual de entrar a sus clientes de correo, no sucediera que hubieran recibido el e-mail de sus vidas en un despiste. Proseg&iacute;an mirando webs, blogs, gestores de rss feeds, la web de la empresa, conectaban por shh o terminal server a sus servidores, no fuera a ser que se hubiera revelado alg&uacute;n servicio en su ausencia, etc.   En fin, que ca&iacute;an de cabeza en el pozo de las distracciones y no prestaban m&aacute;s que un 30% de su atenci&oacute;n al conferenciante, y ese 30% tampoco se ve&iacute;a de mucha intensidad. Hab&iacute;an unos pocos asistentes m&aacute;s que en cambio escuchaban atentamente sin tomar notas. Sol&iacute;an ser los que acababan preguntando al final de la sesi&oacute;n. Y luego estaba yo, con un peque&ntilde;o ordenador de 8 a&ntilde;os de antig&uuml;edad que pocos sab&iacute;an identificar, y aporreandolo como un poseso. Supongo que ese d&iacute;a fui all&iacute; el rey de los <em>geeks</em>.</p>
<p style="text-align: center;"><img title="96331-83261.jpg" src="/img/posts/96331-83261.jpg" alt="96331-83261.jpg" /></p>
<p>Para seguir sin complicar el asunto utilic&eacute; para respaldar mis textos un simple editor que guardaba las notas de cada sesi&oacute;n en un fichero de formato plano txt, con copias en la memoria principal y en la tarjeta CF. Despu&eacute;s, al final del d&iacute;a mont&eacute; un zip con todos los ficheros de texto y los envi&eacute; por infrarojos a la <a href="http://es.wikipedia.org/wiki/Treo_650">Treo 650</a> que siempre me acompa&ntilde;a, y de ah&iacute; al ordenador del trabajo.</p>
<p>Creo sinceramente que he encontrado mi herramienta ideal para gestionar textos, se llama Psion 5mx y fue novedad all&aacute; por 1999 ;-)</p>
<p>Si la obsolescencia de un gadget se midiera por su utilidad y no por la fecha de fabricaci&oacute;n, los ordenadores psion estar&iacute;an siempre de rabiosa actualidad.</p>
</div>


    </main>

    
  </body>
</html>
