<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>Amazon S3: un servicio bueno, bonito y barato pero nada práctico. &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  <style>
aside.sidebar h1 {
	font-size: 2.8rem;
}
</style>
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="https://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="https://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>Amazon S3: un servicio bueno, bonito y barato pero nada práctico.</h1>
  <time datetime=2007-07-12T00:00:00Z class="post-date">Thu, Jul 12, 2007</time>
  <p>Recientemente compr&eacute; (y luego cancel&eacute;) una cuenta de <a href="http://www.amazon.com/gp/browse.html?node=16427261">Amazon Simple Storage Service (Amazon S3)</a>. Un espacio de almacenamiento virtual, dig&aacute;mosle un disco duro, a un precio muy competitivo.</p>
<p>Con S3, pagas tan s&oacute;lo lo que usas. En dos conceptos diferentes: por espacio que consumes al mes, y por peticiones que recibe el servidor.</p>
<p>Para hacernos una r&aacute;pida idea de los precios, si tenemos que almacenar unos <strong>10GB nos costar&iacute;an </strong>1,5$ al mes. Luego, la transferencia de datos a parte, que cuesta 0,01$ por escribir o listar 1000 objetos (operaciones PUT/LIST) y otro c&eacute;ntimo de d&oacute;lar por descargar (GET) 10.000 objetos. No se cobra por borrar. Vaya, que pagas m&aacute;s de la comisi&oacute;n del banco por cambio de moneda que lo que vas a gastar haciendo copias de seguridad de tus ficheros</p>
<p>B&aacute;sicamente este servicio te permite:</p>
<ul>
<li>Escribir, leer y borrar objetos de hasta 5Gb cada uno, sin limitaci&oacute;n en el n&uacute;mero de objetos que vas a guardar.</li>
<li>Recuperar los objetos a trav&eacute;s de un ID y clave &uacute;nicas (no recordables por un ser humano)</li>
<li>Sistemas de autenticaci&oacute;n para recuperar objetos y poder decidir cuales son privados o p&uacute;blicos</li>
<li>A trav&eacute;s de REST y SOAP gestionar los objetos</li>
<li>Bajarlos a trav&eacute;s de HTTP y BitTorrent (de momento)</li>
</ul>
<p>Amazon S3 tiene realmente un precio muy competente, pero no est&aacute; todav&iacute;a preparado para el usuario final (ni creo que lo prentedan por ahora)</p>
<p>Aunque hay gente que se ha espabilado y han salido diversas aplicaciones que te permiten interactuar con el servicio, en mi opini&oacute;n Amazon deber&iacute;a proporcionar una interfaz WEB bajo la cual se pudieran gestionar los ficheros, cambiar permisos, etc... Sobretodo el tema referente al cambiar permisos, decidir cuales son p&uacute;blicos y cuales no, ya que hay que ser un poco <em>freaky</em> para organizar todo esto :(</p>
<h2>Recursos para gestionar S3</h2>
<p>La aplicaci&oacute;n que m&aacute;s me ha gustado mientras he tenido la cuenta ha sido <a title="Ir a la p&aacute;gina de JungleDisk" href="http://www.jungledisk.com/">JungleDisk</a>, que te permite montar Amazon S3 como una unidad de disco utilizando WebDAV: tanto en Mac, Windows como en Linux (este &uacute;ltimo no lo llegu&eacute; a probar), ahi van un par de pantallazos de la versi&oacute;n Windows mientras lo usaba:</p>
<p class="center" style="text-align: center;"><a class="thickbox" href="/img/posts/96347-83182.jpg" alt="96347-83182.jpg" width="200" height="156" /></a></p>
<p>Con JungleDisk puedes arrastrar los ficheros a la unidad y se suben autom&aacute;ticamente, como si fuera otra unidad de red m&aacute;s. Los cambios <strong>parecen</strong> instant&aacute;neos pero lo que realmente sucede es que JungleDisk pone en una cola los ficheros y los va subiendo poco a poco, a velocidad real de red. Si algo tiene muy bueno es que cachea los listados y tu cuenta no sube de precio por hacer LIST innecesariamente y que tambi&eacute;n tiene una versi&oacute;n USB en 8MB que funciona en linux, win y mac a la vez, muy interesante.</p>
<p>Tambi&eacute;n hay otros scripts interesantes en ruby, python y muchisimas utilidades command-line que encontrar&aacute;s f&aacute;cilmente por la red. Asimismo. tambi&eacute;n existe una API interesante para PHP llamada <a href="http://code.google.com/p/php-aws/">PHP-AWS</a> que descargu&eacute; (checkout subversion) y utiliz&eacute; para programar una sencilla interfaz web (nada que ense&ntilde;ar). Tambi&eacute;n hay APIs disponibles para otros lenguajes.</p>
<p>En cuanto a la generaci&oacute;n de c&oacute;digo REST y SOAP para utilizar Amazon S3 <strong>en su pleno potencial</strong> no te queda m&aacute;s remedio que darle a la manija y ponerte las pilas. Una ayudita para generar c&oacute;digo la tienes en el <a href="http://www.awszone.com/">AWS Zone</a></p>
<p>M&aacute;s recursos en el <a href="http://jeremy.zawodny.com/blog/archives/007641.html">blog de Jeremy Zawodny</a></p>
<h2>Inconvenientes de S3 y por qu&eacute; he dejado de usarlo (por ahora)</h2>
<p>Bueno, habr&aacute;s visto que de usuario final <strong>nada</strong>, que uno tiene que poner mucho de su parte si quiere sacarle partido a la cuenta. A parte de eso:</p>
<ul>
<li>Amazon no dispone de una interfaz web para interactuar con tus objetos. Como m&iacute;nimo me gustar&iacute;a poder abrir my bucket y decir, "esta carpeta es p&uacute;blica", pero nada, esto no existe...</li>
<li>Los objetos se encriptan por defecto, cosa que est&aacute; muy bien, pero luego cuando los quieres descargar via HTTP, como decimos por aqu&iacute;, <em>BUTIFARRA!</em>. Tienes que programarte tu mismo esa interfaz para interactuar con el servicio.</li>
<li>Tampoco dispone de una documentaci&oacute;n s&oacute;lida. Si tenemos en cuenta que para cambiar los permisos o hacer opearciones 'de verdad' tienes que interactuar via SOAP, la verdad, uno es freaky, pero a veces se cansa de googlear continuamente.</li>
<li>Hacer un Backup de verdad via red, es muy lento. Esto puede servir para guardar tus PDFs, pero no para subir tus fotos de la comuni&oacute;n.</li>
</ul>
<p>Amazon S3 est&aacute; muy bien para complementar el almacenamiento de las webs de tus clientes, pero para hacer backups, la red no da tanto de s&iacute;. Siempre va a ser mucho m&aacute;s r&aacute;pido hacerlo en local. En cuanto al usuario i final y guardar mis documentos online, si te conformas con arrastrar y soltar, y depender de JungleDisk por el resto de tus d&iacute;as, quiz&aacute; tampoco est&aacute; mal. Eso s&iacute;, para guardar Gigas de informaci&oacute;n.... &aacute;rmate de paciencia.</p>
<p>Si como yo, lo quieres probar, a mi la broma me ha costado 1.13? :)</p>
</div>


    </main>

    
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;
	ga('create', 'UA-130600512-1', 'auto');
	
	ga('send', 'pageview');
}
</script>
<script async src='https://www.google-analytics.com/analytics.js'></script>

  </body>
</html>
