<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-us" lang="en-us">
<head>
  <link href="//gmpg.org/xfn/11" rel="profile">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta name="generator" content="Hugo 0.49" />

  
  <meta name="viewport" content="width=device-width, initial-scale=1.0">

  <title>Comentarios a la presentación de Steve Jobs en la Apple WWDC 2007 &middot; Harecoded</title>

  
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/print.css" media="print">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/poole.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/syntax.css">
  <link type="text/css" rel="stylesheet" href="https://www.harecoded.com/css/hyde.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Abril+Fatface|PT+Sans:400,400i,700">


  
  <link rel="apple-touch-icon-precomposed" sizes="144x144" href="/apple-touch-icon-144-precomposed.png">
  <link rel="shortcut icon" href="/favicon.png">

  
  <link href="" rel="alternate" type="application/rss+xml" title="Harecoded" />

  <style>
aside.sidebar h1 {
	font-size: 2.8rem;
}
</style>
</head>

  <body class=" ">
  <aside class="sidebar">
  <div class="container sidebar-sticky">
    <div class="sidebar-about">
      <a href="https://www.harecoded.com/"><h1>Harecoded</h1></a>
      <p class="lead">
       Harecoded WAS a software development blog with generalistic recipes, some tricks and a little bit of advice.
    Officialy discontinued in the year 2014.
   
      </p>
    </div>

    <nav>
      <ul class="sidebar-nav">
        <li><a href="https://www.harecoded.com/">Home</a> </li>
        <li><a href="/about-us-96286/"> About us </a></li>
      </ul>
    </nav>

    <p>&copy; 2018. All rights reserved. </p>
  </div>
</aside>

    <main class="content container">
    <div class="post">
  <h1>Comentarios a la presentación de Steve Jobs en la Apple WWDC 2007</h1>
  <time datetime=2007-06-12T00:00:00Z class="post-date">Tue, Jun 12, 2007</time>
  <p>Las expectativas respecto a las novedades que Steve Jobs iba a desvelar ayer en la <a href="http://developer.apple.com/wwdc/">conferencia para desarrolladores de Apple</a> que tiene lugar estos d&iacute;as eran tan altas que parece que algunos se han quedado con mucha hambre todav&iacute;a... hambre de hardware.</p>
<div style="text-align: center;"><img title="96335-83189.jpg" src="/img/posts/96335-83189.jpg" alt="96335-83189.jpg" /></div>
<p>Y es que Steve present&oacute; durante largo rato el nuevo <a href="http://www.apple.com/es/macosx/leopard/">Mac OSX Leopard</a> y habl&oacute; al final de la sesi&oacute;n de ciertos aspectos del iPhone (que en breve se comercializar&aacute; en EEUU), pero dada la gran cantidad de rumores respecto a nuevo hardware que hab&iacute;an estado circulando los &uacute;ltimos meses por la blogsfera mac, parece que se qued&oacute; bastante corto. A saber:</p>

<ul>
<li>Nuevos imac, con un aspecto metalizado y pantallas LED. - Nuevo MacBook Pro de 12" ultraligero.</li>
<li>Nuevo tablet de Apple, a medio camino entre pda y port&aacute;til.&nbsp;</li>
<li>Nuevo Mac Mini.&nbsp;</li>
<li>Nuevos ipod con la interfaz del iPhone, pero sin tel&eacute;fono ni navegador web.&nbsp; </li>
</ul>

<p>En fin, como pod&eacute;&iacute;s ver las expectativas sobre nuevo hardware eran bastante altas, y aunque nadie cre&iacute;a que se fueran a cumplir en m&aacute;s de un 50%, s&iacute; que parec&iacute;a que todos estaban de acuerdo que como m&iacute;nimo iban a caer un par de novedades.  Y es que as&iacute; como Steve Jobs sabe que nos tiene encandilados por la combinaci&oacute;n casi perfecta que hace de software y hardware, tambi&eacute;n deber&iacute;a saber que no puede a estas alturas realizar una gran keynote sin presentar novedades en ambas divisiones.</p>
<p>Y s&iacute;, el iPhone es hardware y todav&iacute;a no se ha comercializado, pero por extra&ntilde;o que parezca, ya no es novedad... quiero decir, ya ha sido presentado previamente y por tanto no produce el efecto 'Wow' de ver por primera vez una nueva m&aacute;quina con la manzanita serigrafiada.</p>
<p>Yo particularmente estaba esperando una tablet que revolucionara la computaci&oacute;n m&oacute;vil y cubriera un segmento nuevo de mercado (para ellos)... as&iacute; que me ha pasado igual que a muchos; mi gozo en un pozo.</p>
<p>Supongo que como hay funcionalidades de este tablet que se solapar&iacute;an con lo que ofrece el <a href="http://www.apple.com/iphone/">iPhone</a>, tendremos que esperar al menos un a&ntilde;o para ver la acogida de este &uacute;ltimo y que los usos que no pueda cubrir por tama&ntilde;o se vean asistidos por la aparici&oacute;n de un nuevo tablet... tama&ntilde;o <a href="http://es.wikipedia.org/wiki/Formato_de_papel">DIN A5</a> ser&iacute;a perfecto.</p>
</div>


    </main>

    
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;
	ga('create', 'UA-130600512-1', 'auto');
	
	ga('send', 'pageview');
}
</script>
<script async src='https://www.google-analytics.com/analytics.js'></script>

  </body>
</html>
