<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
  <channel>
    <title>Reviews on Harecoded</title>
    <link>http://www.harecoded.com/tags/reviews/</link>
    <description>Recent content in Reviews on Harecoded</description>
    <generator>Hugo -- gohugo.io</generator>
    <language>en-us</language>
    <lastBuildDate>Sat, 09 Oct 2010 20:39:00 +0000</lastBuildDate>
    
	<atom:link href="http://www.harecoded.com/tags/reviews/index.xml" rel="self" type="application/rss+xml" />
    
    
    <item>
      <title>Musica online gratis y sin anuncios</title>
      <link>http://www.harecoded.com/musica-online-gratis-anuncios-915374/</link>
      <pubDate>Sat, 09 Oct 2010 20:39:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/musica-online-gratis-anuncios-915374/</guid>
      <description>Desde hace ya bastantes meses vengo usando Grooveshark. Un servicio de streaming que te permite escuchar la m&amp;uacute;sica que quieras de forma gratuita, que a diferencia de Spotify en su versi&amp;oacute;n gratuita no ponen cortes publicitarios, cosa que se agradece enormemente. Grooveshark solo muestra un banner en un lado del reproductor web, por lo que se puede dejar abierto en segundo plano y seguir con otras cosas.

Hoy he descubierto adem&amp;aacute;s PlayListNow, un servicio que ofrece m&amp;uacute;sica en funci&amp;oacute;n de lo que est&amp;eacute;s haciendo en ese momento.</description>
    </item>
    
    <item>
      <title>Teclados mediacenter para el comedor</title>
      <link>http://www.harecoded.com/teclados-mediacenter-comedor-310963/</link>
      <pubDate>Thu, 06 Aug 2009 00:34:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/teclados-mediacenter-comedor-310963/</guid>
      <description>Actualmente dispongo de un ruidoso PC de DELL con la &amp;uacute;ltima versi&amp;oacute;n de Ubuntu que utilizo a modo de media center en el comedor de casa. Estoy content&amp;iacute;simo de como funciona, pero para manejarlo tengo uno de los teclados m&amp;aacute;s grandes de la historia (uno de esos que tienen botones hasta para tirar de la cadena del ba&amp;ntilde;o remotamente) junto con otro rat&amp;oacute;n que me desespera al uso.
El teclado no lo puedo perder porque es grandioso, pero el rat&amp;oacute;n lo pierdo casi a diario (adem&amp;aacute;s que funciona realmente mal), asi que harto de la situaci&amp;oacute;n me dispongo a buscar una teclado con rat&amp;oacute;n/trackpad integrado para el comedor (tambi&amp;eacute;n deber&amp;iacute;a cambiar el PC por un Mac Mini, menos bulto y m&amp;aacute;s majo, pero eso ya es otro tema).</description>
    </item>
    
    <item>
      <title>Spotify, escuchar música online. Competencia de Last.fm</title>
      <link>http://www.harecoded.com/spotify-escuchar-musica-online-competencia-lastfm-193785/</link>
      <pubDate>Tue, 27 Jan 2009 15:13:48 +0000</pubDate>
      
      <guid>http://www.harecoded.com/spotify-escuchar-musica-online-competencia-lastfm-193785/</guid>
      <description>Llevo unos d&amp;iacute;as probando Spotify, gracias a una cuenta beta gratuita que me di&amp;oacute; mi compa&amp;ntilde;ero de trabajo Rufino . Para quienes no hayan o&amp;iacute;do hablar de Spotify es un reproductor de m&amp;uacute;sica en streaming (es decir, la m&amp;uacute;sica no est&amp;aacute; en tu ordenador, sino en sus servidores). Hay que bajarse el programa, que de momento est&amp;aacute; disponible s&amp;oacute;lo para Mac y Windows (Linux a trav&amp;eacute;s de Wine).
La aplicaci&amp;oacute;n promete mucho (no he probado la de pago), pero lo que se se puede hacer con la versi&amp;oacute;n gratuita incita a usar el programa en su forma completa.</description>
    </item>
    
    <item>
      <title>ipod touch first impressions, a great experience so far</title>
      <link>http://www.harecoded.com/ipod-touch-first-impressions-great-experience-so-far-96356/</link>
      <pubDate>Mon, 29 Oct 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/ipod-touch-first-impressions-great-experience-so-far-96356/</guid>
      <description>A few days ago I said: ipod touch, I&#39;ll pass on this one. Can you guess what happened next? Well, it is pretty obvious... I bought one. I was extremely happy with an ipod nano 8Gb I bought 2 weeks ago, but a colleague of mine came to the office with a shinny new ipod touch, bought at the Apple store. One touch that had no TFT contrast problems, one touch jailbreaked with lots of apps, one touch with a terminal, ssh access and even an ebook reader.</description>
    </item>
    
    <item>
      <title>Automatic keylock for windows mobile smartphone edition</title>
      <link>http://www.harecoded.com/automatic-keylock-for-windows-mobile-smartphone-edition-96353/</link>
      <pubDate>Thu, 04 Oct 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/automatic-keylock-for-windows-mobile-smartphone-edition-96353/</guid>
      <description>I&#39;m having some fun testing a Samsung i600 (a.k.a. Blackjack) windows mobile smartphone edition. I will probably sell it to someone else who has more respect for Microsoft software, but the Samsung hardware is top notch nonetheless, and I&#39;m liking the device more and more.
Samsung tries very hard to disguise windows on this mobile, and the result is very good, frankly. Just like Nokia&#39;s Symbian 3rd edition mobiles, this Samsung i600 comes with no automatic keylock, which is INSANE.</description>
    </item>
    
    <item>
      <title>Ipod touch, I&#39;ll pass on this one</title>
      <link>http://www.harecoded.com/ipod-touch-ill-pass-on-this-one-96351/</link>
      <pubDate>Thu, 27 Sep 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/ipod-touch-ill-pass-on-this-one-96351/</guid>
      <description>Last week I sold my 30Gb ipod video for a bargain prize, just anticipating the shinny acquisition of a new generation ipod. I was never very happy with the ipod video anyways, being the main gripe its short battery life, which could only handle 2 hours of video playback and no more than 10 hours of music. I was never able to abstract from this issue, always observing the battery meter on the screen.</description>
    </item>
    
    <item>
      <title>Amazon S3: un servicio bueno, bonito y barato pero nada práctico.</title>
      <link>http://www.harecoded.com/amazon-s3-servicio-bueno-bonito-barato-nada-practico-96347/</link>
      <pubDate>Thu, 12 Jul 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/amazon-s3-servicio-bueno-bonito-barato-nada-practico-96347/</guid>
      <description>Recientemente compr&amp;eacute; (y luego cancel&amp;eacute;) una cuenta de Amazon Simple Storage Service (Amazon S3). Un espacio de almacenamiento virtual, dig&amp;aacute;mosle un disco duro, a un precio muy competitivo.
Con S3, pagas tan s&amp;oacute;lo lo que usas. En dos conceptos diferentes: por espacio que consumes al mes, y por peticiones que recibe el servidor.
Para hacernos una r&amp;aacute;pida idea de los precios, si tenemos que almacenar unos 10GB nos costar&amp;iacute;an 1,5$ al mes.</description>
    </item>
    
    <item>
      <title>Subtle differences between Safari for Windows and Mac?</title>
      <link>http://www.harecoded.com/subtle-differences-between-safari-for-windows-and-macr-96343/</link>
      <pubDate>Mon, 25 Jun 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/subtle-differences-between-safari-for-windows-and-macr-96343/</guid>
      <description>I have tested Safari for Windows during ONE minute, but I think I have seen it all....
While I was testing a layout in progress for a new site (appareantly was working in all browsers) I found a subtle difference.... Nothing to worry about, though (sorry for the small image):

Shame on you Apple!</description>
    </item>
    
    <item>
      <title>Introspección gadgetera</title>
      <link>http://www.harecoded.com/introspeccion-gadgetera-96341/</link>
      <pubDate>Wed, 20 Jun 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/introspeccion-gadgetera-96341/</guid>
      <description>A ra&amp;iacute;z de unos art&amp;iacute;culos (1 y 2) muy interesantes del compa&amp;ntilde;ero Serantes, &#39;gadgetero&#39; e inductor de compras donde los haya, me he puesto tambi&amp;eacute;n a pensar en mi relaci&amp;oacute;n con los aparatos electr&amp;oacute;nicos que pueblan mis estanter&amp;iacute;as y mochila...
Viene a ser una excusa cualquiera para autoanalizarme, para realizar una introspecci&amp;oacute;n aunque sea s&amp;oacute;lo en esta peque&amp;ntilde;a parcela de mi vida. Como David, realizar&amp;eacute; un breve an&amp;aacute;lisis donde colocar&amp;eacute; en dos zonas bien diferenciadas los dispositivos electr&amp;oacute;nicos que uso en la actualidad:</description>
    </item>
    
    <item>
      <title>A fantastic rss reader: readermini.com</title>
      <link>http://www.harecoded.com/fantastic-rss-reader-readerminicom-96339/</link>
      <pubDate>Sun, 17 Jun 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/fantastic-rss-reader-readerminicom-96339/</guid>
      <description>I have been searching for a good rss reader since I switched my Nokia N800 for a Nokia 770, as the latter doesn&#39;t come with a default application for handling news feeds. And since I had already found a truly perfect image viewer, this became the last software I needed to complete what was a fantastic mobile computer by the way.
I am a big fan of Google Reader, to the point that I stopped using Netnewswire, one of the best Mac OSX apps in my opinion.</description>
    </item>
    
    <item>
      <title>Why I Changed my brand new Nokia N800 For a 770 (and something more)</title>
      <link>http://www.harecoded.com/why-i-changed-my-brand-new-nokia-n800-for-770-and-something-more-96334/</link>
      <pubDate>Sat, 09 Jun 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/why-i-changed-my-brand-new-nokia-n800-for-770-and-something-more-96334/</guid>
      <description>Nokia had a relative success selling the first incarnation of its Internet tablet concept: the Nokia 770.
Quietly and without much advertising, the company managed to grab the attention of a lot of geeks (mostly in the Linux domain) who quickly saw a device full of software hackabilities (a.k.a. possibilities). That is exactly the level of attention that Palm pretends/needs to make the Foleo the start of a successful line of products, but if they do not opensource its.</description>
    </item>
    
    <item>
      <title>De conferencias con una Psion 5mx</title>
      <link>http://www.harecoded.com/conferencias-psion-5mx-96331/</link>
      <pubDate>Mon, 04 Jun 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/conferencias-psion-5mx-96331/</guid>
      <description>Hace unos d&amp;iacute;as tuve la oportunidad de asistir a la PHP Conference 2007 spring edition celebrada en Stuttgart, Alemania. Dada la experiencia de conferencias anteriores, sab&amp;iacute;a al 100% que no quer&amp;iacute;a llevar un port&amp;aacute;til a las sesiones... Lo he hecho otras veces y odio tener que arrastrar los kilos de tecnolog&amp;iacute;a a todas partes para usarlos s&amp;oacute;lo en contadas ocasiones. Pero sobre todo, odio la dependenia que provoca de los enchufes.</description>
    </item>
    
    <item>
      <title>Difficult to implement a GTD system on PalmOS... too many choices!!!</title>
      <link>http://www.harecoded.com/difficult-to-implement-gtd-system-on-palmos-too-many-choices-96328/</link>
      <pubDate>Tue, 06 Feb 2007 00:00:00 +0000</pubDate>
      
      <guid>http://www.harecoded.com/difficult-to-implement-gtd-system-on-palmos-too-many-choices-96328/</guid>
      <description>These last days I am trying to be very serious about implementing GTD on my Treo 650. This is something that I have been wanting to do for quite some time, but I have been delaying as it demanded to sit for a while and start playing with different strategies to find a system that suits my needs and makes me comfortable with the organizational burden.
There are several applications on Palm devices that can help us with this GTD implementation: outliners (shadow plan, bonsai comes to mind), project managers (progect), wiki apps (note studio), time managers (Datebk), plain vanilla apps (Palm To Do, Calendar, Contacts), etc.</description>
    </item>
    
  </channel>
</rss>